--練習問題3.2
  SELECT shohin_bunrui, SUM(hanbai_tanka), SUM(shiire_tanka) --商品分類、販売単価の合計、仕入れ単価の合計をカラムとして出力
    FROM Shohin
GROUP BY shohin_bunrui                                       --商品分類でグループ化（これがないとSELECTで指定できない）
  HAVING SUM(hanbai_tanka) > SUM(shiire_tanka) * 1.5;        --販売単価の合計が仕入れ単価の合計の1.5倍より大きい
/*
 shohin_bunrui | sum  | sum
---------------+------+------
 衣服          | 5000 | 3300
 事務用品      |  600 |  320
(2 行)
*/

--練習問題3.3
  SELECT *
    FROM Shohin
ORDER BY torokubi DESC, hanbai_tanka;
/*
 shohin_id |   shohin_mei   | shohin_bunrui | hanbai_tanka | shiire_tanka |  torokubi
-----------+----------------+---------------+--------------+--------------+------------
 0003      | カッターシャツ | 衣服          |         4000 |         2800 |
 0008      | ボールペン     | 事務用品      |          100 |              | 2009-11-11
 0006      | フォーク       | キッチン用品  |          500 |              | 2009-09-20
 0001      | Tシャツ        | 衣服          |         1000 |          500 | 2009-09-20
 0004      | 包丁           | キッチン用品  |         3000 |         2800 | 2009-09-20
 0002      | 穴あけパンチ   | 事務用品      |          500 |          320 | 2009-09-11
 0005      | 圧力鍋         | キッチン用品  |         6800 |         5000 | 2009-01-15
 0007      | おろしがね     | キッチン用品  |          880 |          790 | 2008-04-28
(8 行)
*/
